/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "输入凭证";
"CONNECT_TO_SERVER" = "连接服务器";
"PRINTER_AUTH" = "打印机鉴定";
"SCREEN_SHARE_AUTH" = "共享屏幕";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "请输入您的名称和密码以连接到“%@”。";
"GENERIC_MSG_PASS" = "请输入您的密码以连接“%@”。";
"GENERIC_MSG_NONAME" = "输入您的用户名称和密码。";

/* Protocol Specific */
"AFP_MSG" = "请输入服务器“%@”的名称和密码。";
"SMB_MSG" = "请输入服务器“%@”的名称和密码。";
"FTP_MSG" = "请输入服务器“%@”的名称和密码。";
"WEBDAV_MSG" = "请输入服务器“%@”的名称和密码。";

/* File Server */
"FS_MSG_BOTH" = "请输入服务器“%@”的名称和密码。";
"FS_MSG_PASS" = "请输入服务器“%@”的密码。";

/* Generic Server */
"SRV_MSG_BOTH" = "请输入服务器“%@”的名称和密码。";
"SRV_MSG_PASS" = "请输入服务器“%@”的密码。";

/* Printer */
"PRINT_MSG_BOTH" = "请输入打印机“%@”的名称和密码。";
"PRINT_MSG_PASS" = "请输入打印机“%@”的密码。";

/* Print Server */
"PS_MSG_BOTH" = "请输入该打印服务器“%@”的用户名称和密码。";
"PS_MSG_PASS" = "请输入该打印服务器“%@”的用户名称和密码。";

/* Screen Sharing */
"SS_MSG_BOTH" = "请输入您的用户名称和密码以共享“%@”的屏幕。";
"SS_MSG_PASS" = "请输入密码以共享“%@”的屏幕。";

"VS_MSG_BOTH" = "输入您的用户名称和密码以查看“%@”的屏幕。";
"VS_MSG_PASS" = "请输入密码以查看“%@”的屏幕。";

/* Time Machine */
"TM_MSG_BOTH" = "请输入服务器“%@”的名称和密码，以便 Time Machine 可以访问它。";
"TM_MSG_PASS" = "请输入服务器“%@”的密码，以便 Time Machine 可以访问它。";

/* Pre Auth */
"PA_MSG_BOTH" = "请输入用于代理服务器“%@”的名称和密码。";
"PA_MSG_PASS" = "请输入用于代理服务器“%@”的密码。";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "连接";
"SHARE" = "共享";
"PRINT" = "打印";
"VIEW" = "显示";
"OK" = "好";

"CONNECT_AS" = "连接身份：";
"GUEST" = "客人";
"REGISTERED_USER" = "注册用户";

"CONNECT_BY" = "连接：";
"BY_ASKING_FOR_PERMISSION" = "通过请求权限";
"AS_REGISTERED_USER" = "作为注册用户";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "域\\用户名称";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "选择您想要装在“%@”上的宗卷：";
"SELECT_VOLUME" = "选择要装载的宗卷：";

"SELECT_PRINTER_ON_SERVER" = "选择在“%@”上的打印机：";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "西语（Mac）";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "更改“%2$@”上的“%1$@”的密码。";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "正在连接…";
"CONNECTING_TO_HOST" = "正在连接到“%@”。";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "请输入文件服务器“%2$@”上“%1$@”的密码。";
"ENTER_VOLUME_PASSWORD" = "请输入“%@”的密码。";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "网络密码";
"PRINT_PASSWORD" = "打印机密码";
"AFP_PASSWORD" = "AFP 密码";
"SMB_PASSWORD" = "SMB 密码";
"FTP_PASSWORD" = "FTP 密码";
"WEBDAV_PASSWORD" = "WebDAV 密码";
"VNC_PASSWORD" = "VNC 密码";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "发生错误。";
"EMSG_INVALID_PWD" = "您输入了无效的密码。";
"EMSG_INVALID_NAME_PWD" = "您输入的用户名称或密码无效。";
"EMSG_PWD_EXPIRED" = "您的密码已过期。";
"EMSG_PWD_NEEDS_CHANGE" = "您的密码需要更改。";
"EMSG_PWD_POLICY" = "您的密码不符合服务器执行的政策要求。";
"EMSG_CONNECTION_FAILED" = "连接失败";

"EMSG_MOUNT_FAILURE" = "宗卷装载失败。";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "请再试一次。";
"EINFO_CONTACT_ADMIN" = "请联系您的系统管理员以获得更多信息。";

"EINFO_NO_ACCESS_USER" = "您没有访问服务器“%@”的权限。";
"EINFO_NO_ACCESS_GUEST" = "服务器“%@”不允许客人访问。";
"EINFO_SAME_MACHINE" = "服务器“%@”已在您的电脑上可用。请从本地访问宗卷和文件。";
"EINFO_NO_SERVER" = "服务器“%@”可能不存在，或者它此时不可用。请检查服务器名称或 IP 地址以及您的网络连接，然后再试一次。";
"EINFO_TOO_MANY_USERS" = "服务器“%@”将不允许任何额外的用户登录。请稍后再尝试连接。";
"EINFO_GENERAL" = "连接服务器“%@”时出错。请检查服务器名称或 IP 地址，然后再试一次。\n\n如果您无法解决该问题，请联系系统管理员。";
"EINFO_NO_SHARES" = "没有可用的共享项目，或者不允许您访问该服务器“%@”上的共享项目。请联系您的系统管理员以解决该问题。";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "您没有访问此服务器的权限。";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "此服务器不允许客人访问。";
"EINFO_SAME_MACHINE_UNKNOWN" = "此文件服务器已在您的电脑上可用。请从本地访问宗卷和文件。";
"EINFO_NO_SERVER_UNKNOWN" = "该服务器可能不存在，或者它此时不可用。请检查服务器名称或 IP 地址以及您的网络连接，然后再试一次。";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "此文件服务器将不允许任何额外的用户登录。请稍后再尝试连接。";
"EINFO_GENERAL_UNKNOWN" = "连接服务器时出错。请检查服务器名称或 IP 地址，然后再试一次。\n\n如果您无法解决该问题，请联系系统管理员。";
"EINFO_NO_SHARES_UNKNOWN" = "没有可用的共享项目，或者不允许您访问该服务器上的共享项目。请联系您的系统管理员以解决该问题。";

"EINFO_UNKNOWN_MOUNT_FAILED" = "装载宗卷时出错。";
"EINFO_ONE_MOUNT_FAILED" = "宗卷“%@”未能装载。";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "未能装载以下宗卷：";
